package org.example.lessons.lesson03.homework

// 1. Название мероприятия (неизменяемая публичная переменная известная на момент написания)
val hackathonName: String = "Hackathon Survival"

// 2. Дата проведения (публичная переменная известная на момент написания, но может быть изменена из-за переноса)
var date: String = "Дата проведения"

// 3. Место проведения (известная изменяемая переменная известная на момент написания)
var place: String = "Место проведения"

// 4. Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы. (приватная неизменяемая переменная - её не должны увидеть и бюджет уже запланирован и утверждён и не должен изменяться)
private val budget: String = "Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы."

// 5. Количество участников (изменяемая публичная переменная неизвестная на момент написания)
var numberOfParticipants: Int = 0

// 6. Длительность хакатона (изменяемая публичная переменная неизвестная на момент написания: 1 или 3 дня)
val duration: String = "1-3 дня"

// 7. Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг (приватная неизменяемая переменная)
private val agreementsWithSuppliers: String = "Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг"

// 8. Текущее состояние хакатона (статус) (известная изменяемая публичная переменная известная на момент написания)
var currentStatus: String = "not started"

// 9.Список спонсоров (известная неизменяемая публичная переменная известная на момент написания)
var listOfSponsors: String = "List of sponsors"

// 10. Бюджет мероприятия (известная изменяемая переменная, известная на момент написания)
var eventBudget: Int = 123456789

// 11. Текущий уровень доступа к интернету (известная изменяемая публичная переменная)
var internetAccess: Boolean = true

//12. Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки. (приватная известная переменная, неизменяемая)
private var informationFotTeam: String = " Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки"

// 13. Количество команд
var numberOfTeams: Int = 0

// 14. Перечень задач
val tasks: String = "Перечень задач"

// 15. План эвакуации
var evacuationPlan: String = "План эвакуации"

// 16. Список доступного оборудования (всё, что выделено для использования на мероприятии)
val equipment: String = "Список доступного оборудования"

//17. Список свободного оборудования (всё, что можно взять прямо сейчас и что не занято другими участниками)
val availableEquipmen: String = "Список свободного оборудования "

// 18. График питания участников (зависит от поставщика питания, определяемого за неделю до начала) (публичная изменяемая переменная с отложенной инициализацией, так как на момент создания поставщик и график не известны)
lateinit var mealSchedule: String

// 19. План мероприятий на случай сбоев
var planForServiceDisruptions: String = "План мероприятий на случай сбоев"

// 20. Список экспертов и жюри
val listOfExpertsAndJury: String = "Список экспертов и жюри"

// 21. Политика конфиденциальности
val privacyPolicy: String = "Политика конфиденциальности"

// 22. Приватные отзывы (фидбэк) участников и зрителей для анализа проблем.
private var feedback: String = "Приватные отзывы (фидбэк) участников и зрителей для анализа проблем."

// 23. Текущая температура в помещении
lateinit var temperature: String

// 24. Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами
var data: String = "Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами"

// 25. Регулятор скорости интернета (понижающий коэффициент, например 0.5)
private var internetSpeedRegulator: String = "Регулятор скорости интернета"

// 26. Уровень освещения
var lightingLevel: String = "Уровень освещения"

// 27. Лог событий мероприятия
private var eventLog: String = "Лог событий мероприятия"

// 28. Возможность получения медицинской помощи прямо на мероприятии (да/нет)
val accessToMedicalCare: Boolean = true

// 29. Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций.
var securityPlans: String = "Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций."

// 30. Регистрационный номер мероприятия
val eventRegistrationNumber: String = "Регистрационный номер мероприятия"

// 31. Максимально допустимый уровень шума в помещении хакатона.
val noiseLevel: Int = 1

// 32. Индикатор превышения уровня шума в помещениях (превышен или не превышен в данный момент)
var noiseLevelIndicator: Boolean = false

// 33. План взаимодействия с прессой
private var mediaRelationsPlan: String = "План взаимодействия с прессой"

// 34. Детальная публичная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок.
val projectReports: String by lazy {
    "Детальная публичная информация о проектах каждой команды"
}

// 35. Статус получения всех необходимых разрешений для проведения мероприятия
private lateinit var permitsStatus: String

// 36. Индикатор доступности специализированного оборудования в данный момент (например, специальному оборудованию)
var equipmentAvailabilityIndicator: Boolean = false

// 37. Список партнеров мероприятия
val partnersList: String = "Список партнеров мероприятия"

// 38. Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия.
val photoReports: String by lazy {
    "Отчет, включающий фотографии, видео и отзывы"
}

// 39. Внутренние правила распределения призов
private val prizeDistributionRules: String = "Внутренние правила распределения призов"

// 40. Список разыгрываемых призов
val prizes: String = "Список разыгрываемых призов"

// 41. Контактная информация экстренных служб, медицинского персонала и других важных служб, для внутреннего пользования.
val contactInformation: String = "Контактная информация экстренных служб"

// 42. Особые условия для участников с ограниченными возможностями
val specialArrangements: String = "Особые условия для участников с ограниченными возможностями"

// 43. Общее настроение участников (определяется опросами)
lateinit var overallSentiment: String

// 44. Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия, так как зависит от фактического состава команд и взятых в работу задач.
lateinit var hackathonPlan: String

// 45. Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия, но в момент инициализации неизвестно.
private lateinit var celebrityName: String

// 46. Максимальное количество людей, которое может вместить место проведения.
var maxAmountOfPerticipants: Int = 100

// 47. Количество часов, отведенное каждой команде для работы над проектом.
val workHours: Double = 0.0
